
mode = 0
def get_mode():
    global mode
    mode = int(input('Какую операцию с числами вы хотите выполнить?\n'
                     'Сложение - 1;\n'
                     'Вычитание - 2;\n'
                     'Умножение - 3;\n'
                     'Деление - 4;\n'
                     'Введите номер операции: '))
    return mode

def get_args():
    return input('Введите аргумент(чтобы закончить вводить - введите точку(.):')
oper_dict = {1 : 'сложения', 2 : 'вычитания', 3 : 'умножения', 4 : 'деления'}
def get_result(res):
    return f'Результат операции {oper_dict[mode]} равен {res}'